# Вам дана строка, состоящая из строчных латинских букв и пробелов.
# Ваша задача — определить, является ли эта строка «перевертышем», если удалить из нее все пробелы и знаки пуктуации.
# Строка называется «перевертышем», если читается одинаково слева направо и справа налево.

# Пример строки перевертыша: "И темен город. Мороз узором дорог не мети."

text = "И темен город. Мороз узором дорог не мети."

no_space = text.replace(' ','').replace('.','').lower()

i = 0
j = -1

while i < len(no_space):
    if no_space[i] == no_space[j]:
        i += 1
        j -= 1
    else:
        print('THey are not equal')
        break

if i == len(no_space):
    print('They are equal')
