# Вам дана строка, состоящая из строчных латинских букв и пробелов.
# Ваша задача — определить, является ли эта строка «перевертышем», если удалить из нее все пробелы и знаки пуктуации.
# Строка называется «перевертышем», если читается одинаково слева направо и справа налево.

# Пример строки перевертыша: "И темен город. Мороз узором дорог не мети."

str = input()

new_str = str.replace(" ", "").replace(".", "").replace(",", "").lower()
if new_str == new_str[::-1]:
    print("да")
else:
    print("нет")
