# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

random_list = [2, 3, -3, 5, -1, 9, 8, 1, -1, -4]

print(sum(random_list))
