# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

list = [1, -5, 6, -2, 7, 3, -7]
z = 0
for x in list:
    z = z + x
print(z)
