# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.
nums = [10, -2, 1, -10, 5]
print(sum(nums))
