# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

i = 0
while i < len(fruits):
    print(i+1, fruits[i])
    i += 1
