# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
list_int = [-10, 9, 5, -2]
total = 0
for el in list_int:
    total += el

print(total)
