# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.
mylist = [-10, 2, 11, 3]
s=0
for element in mylist:
    s=s+element

print(s)
# TODO: your code here
