# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
my_list = [-1, 2, 5, -3]

sum_els = 0

for el in my_list:
    sum_els += el
print(sum_els)
