# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here

lst = [-10, 2, 3, 4, -6, 3, 6, 3, 6]
print(sum(lst))
