# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
l = [-5, 2, 5, 10, 3]
sum = 0
for element in l:
    sum += element
print('сумма: ', sum)
