# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.
numb_list=[-10,8,7,-5,7,-3,6,-1,9,3]
summa_numb=0
for ind in numb_list:
    summa_numb+=ind
print(summa_numb)

# TODO: your code here
