# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

Spisok = [-9,9,6,-6,5]

sum =0
for el in Spisok:
    sum += el

print(sum)
