# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

base_tup = (-4, 4, 9, 8, -3)
summ = 0
for el in base_tup:
    summ = summ + el
print (summ)
