# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

max_letters = 0
i = 1
for el in fruits:
    if len(el)>max_letters:
        max_letters = len(el)
for el in fruits:
    print ("{0}. {1}".format (i, (" "*(max_letters-len(el))+el)))
    i+=1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
