# Дан треугольник со сторонами a, b и c. Определите, является ли он равнобедренным.
# Формат входных данных: дано три натуральных числа. Гарантируется, что отрезки с данными длинами образуют треугольник.
# Формат выходных данных: Выведите «YES», если треугольник равнобедренный, и «NO» в противном случае.

a = int(input("side a :"))
b = int(input("side b :"))
c = int(input("side c :"))

if a = b or b==c or a == c :
  print ("yes")
else :
  print ("no")
