# Написать функцию, определяющую кол-во дней в году.
# В обычном году 365 дней, а в високосном - 366. Каждый четвертый год является високосным,
# кроме столетий, которые не делятся нацело на 400.
# Если год не делится нацело на 4, значит сразу можно сделать вывод, что он не является високосным.
# Если все же делится, то надо исключить столетия: они все нацело делятся на 100, но те,
# которые не делятся нацело на 400, високосными не являются.

def days_in_year(year):
    if year % 100 == 0:
        is_leap = year // 100 % 4 == 0
    else:
        is_leap = year % 4 == 0
    return 366 if is_leap else 365

