# На числовой прямой расположены точки A, B, C и D.
# Напишите программу, которая выведет, во сколько раз отрезок AB больше, чем отрезок CD.
# Формат входных данных:
# На вход программе подается четыре целых числа A, B, C и D.
# Расположение точек относительно друг друга на координатной прямой произвольное.
# Формат выходных данных:
# Выведите, во сколько раз отрезок AB больше, чем отрезок CD. Ответ введите с точностью до 6-ти знаков после запятой.

a = int(input("Введите точку А: "))
b = int(input("Введите точку B: "))
c = int(input("Введите точку C: "))
d = int(input("Введите точку D: "))

result = abs(b - a) / abs(d - c)

print(f"{result:.6f}")
