# С некоторого момента прошло некоторое количество дней. Сколько полных недель прошло с этого же момента?
# Формат входных данных: Вводится целое положительное число — количество прошедших дней.
# Формат выходных данных: Выведите целое число недель.

my_days = int(input("Введите количество дней: "))

my_weeks = my_days // 7

print("Количество недель: ", my_weeks)
