# По данному числу n закончите фразу «На лугу пасется...» одним из возможных продолжений:
# «n коров», «n корова», «n коровы», правильно склоняя слово «корова».
# Формат входных данных
# Дано целое положительное число n
# Формат выходных данных
# Программа должна вывести введенное число n и одно из слов (на латинице):
# коров, корова или коровы
# Например, 1 корова, 2 коровы, 5 коров, 125 коров.

n=int(input("n= "))
if n==1:
    print("На лугу пасется ", n , "корова")
elif 1<n<=4:
    print("На лугу пасется ", n, "коровы")
elif n>4:
    print("На лугу пасется ", n, "коров")
else:
    print("Коров нет")
