# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
str_names = str(names).strip('[]').replace("'", "")
print(str_names)
