# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

name_str = ""
i = 1
for name in names:
    name_str += name
    if i < len(names):
        name_str += ', '
    i += 1
print(name_str)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
