# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# str_name = ''
# for name in names:
#     str_name = str_name + name
# print(f"{str_name}")

print(', '.join(names))

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
