# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

s = ''
for name in names:
    s += str(name) + ', '

print(s[:-2])
