# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
x = 1
for name in names:
    if x != len(names):
        print(name, end=', ')
    else:
        print(name, end='')
    x += 1

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
