# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# вариант 1
for name in names:
    print(name, end=", ")
print("\n")

# вариант 2
print(', '.join(names))

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
