# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

s = ', '.join(names)

print(s)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
