# Дан список имен.
# Выведите все имена в одну строку через запятую

#names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]# в столбик, можно в одну строку?
for name in names:
    print(name,',')

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
print(names[0],',',names[1],',',names[2],',',names[3],',',names[4])

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
