# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
st= ""
for name in names:
    if name ==names[-1]:
        st+=name
    else:
        st += name + ", "
print(st)



# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
