# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр

string = ', '.join(names)
print(string)
