# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр

line = ""

for i, name in enumerate(names, 1):
    line += name
    if i < len(names):
        line += ", "

print(line)
