# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

print (list(names))

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
